In [ ]:
#subir csv cuantía
#subir csv tiempo
#subir csv tipo

In [1]:
import pandas as pd
import numpy as np

In [2]:
cuantia = pd.read_csv('C:/Users/Pc/Desktop/Máster/Data Science (Pontia)/Proyecto Jupyter/Csv/cuantia.csv', sep='|')

In [3]:
tiempo = pd.read_csv('C:/Users/Pc/Desktop/Máster/Data Science (Pontia)/Proyecto Jupyter/Csv/tiempo.csv', sep='|')

In [4]:
tipo = pd.read_csv('C:/Users/Pc/Desktop/Máster/Data Science (Pontia)/Proyecto Jupyter/Csv/tipo.csv', sep='|')

In [5]:
df1= cuantia.merge(tiempo ,left_on='t_id', right_on='t_id')

In [6]:
df1.head()

   t_id   cuantia         fecha y hora
0     0   9839.64  2022-09-01 07:00:00
1     1   1864.28  2022-09-01 07:00:00
2     2    181.00  2022-09-01 07:00:00
3     3    181.00  2022-09-01 07:00:00
4     4  11668.14  2022-09-01 07:00:00

In [7]:
df1.tail()

            t_id     cuantia         fecha y hora
6362615  6362615   339682.13  2022-10-02 05:00:00
6362616  6362616  6311409.28  2022-10-02 05:00:00
6362617  6362617  6311409.28  2022-10-02 05:00:00
6362618  6362618   850002.52  2022-10-02 05:00:00
6362619  6362619   850002.52  2022-10-02 05:00:00

In [9]:
df1.sample(5)

            t_id    cuantia         fecha y hora
1717644  1717644  265538.61  2022-09-07 22:00:00
2714654  2714654    3503.33  2022-09-10 01:00:00
5224736  5224736   18205.95  2022-09-16 16:00:00
3798916  3798916  102094.94  2022-09-12 23:00:00
1350721  1350721    9652.94  2022-09-06 23:00:00

In [10]:
df2= df1.merge(tipo ,left_on='t_id', right_on='t_id')

In [11]:
df2.head()

   t_id   cuantia         fecha y hora      tipo
0     0   9839.64  2022-09-01 07:00:00   PAYMENT
1     1   1864.28  2022-09-01 07:00:00   PAYMENT
2     2    181.00  2022-09-01 07:00:00  TRANSFER
3     3    181.00  2022-09-01 07:00:00  CASH_OUT
4     4  11668.14  2022-09-01 07:00:00   PAYMENT

In [12]:
df2.tail()

            t_id     cuantia         fecha y hora      tipo
6362615  6362615   339682.13  2022-10-02 05:00:00  CASH_OUT
6362616  6362616  6311409.28  2022-10-02 05:00:00  TRANSFER
6362617  6362617  6311409.28  2022-10-02 05:00:00  CASH_OUT
6362618  6362618   850002.52  2022-10-02 05:00:00  TRANSFER
6362619  6362619   850002.52  2022-10-02 05:00:00  CASH_OUT

In [13]:
df2.sample(5)

            t_id    cuantia         fecha y hora      tipo
661460    661460  310391.36  2022-09-02 18:00:00  CASH_OUT
578730    578730  191387.99  2022-09-02 15:00:00   CASH_IN
6220311  6220311   20757.08  2022-09-25 19:00:00  CASH_OUT
1667549  1667549   85921.61  2022-09-07 20:00:00  CASH_OUT
1859248  1859248   22171.33  2022-09-08 02:00:00   PAYMENT

In [14]:
df2= df2.rename(columns={'fecha y hora': 'tiempo'})

In [15]:
df2= df2.rename(columns={'cuantia': 'monto'})

In [16]:
df2.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 6362620 entries, 0 to 6362619
Data columns (total 4 columns):
 #   Column  Dtype
---  ------  -----
 0   t_id    int64
 1   monto   float64
 2   tiempo  object
 3   tipo    object
dtypes: float64(1), int64(1), object(2)
memory usage: 242.7+ MB

In [18]:
df2['tiempo'] = df2['tiempo'].astype('datetime64')

In [19]:
df2['tipo'] = df2['tipo'].astype('string')

In [20]:
df2.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 6362620 entries, 0 to 6362619
Data columns (total 4 columns):
 #   Column  Dtype
---  ------  -----
 0   t_id    int64
 1   monto   float64
 2   tiempo  datetime64[ns]
 3   tipo    string
dtypes: datetime64[ns](1), float64(1), int64(1), string(1)
memory usage: 242.7 MB

In [21]:
df2.head()

   t_id     monto              tiempo      tipo
0     0   9839.64 2022-09-01 07:00:00   PAYMENT
1     1   1864.28 2022-09-01 07:00:00   PAYMENT
2     2    181.00 2022-09-01 07:00:00  TRANSFER
3     3    181.00 2022-09-01 07:00:00  CASH_OUT
4     4  11668.14 2022-09-01 07:00:00   PAYMENT

In [ ]:
df2.to_csv('C:/Users/maria/OneDrive/Escritorio/pontia/Proyecto/transacciones.csv', sep='|', index=False)